app/controllers/api/boards_controller.rb

  def create
    @board = Board.new(board_params)

    if @board.save
---
INSERT INTO "boards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Classics"], ["created_at", "2020-04-27 22:15:47.860540"], ["updated_at", "2020-04-27 22:15:47.860540"]]

  def show
    @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]