app/controllers/api/cards_controller.rb

  def create
    list = List.find(params[:list_id])
    @card = Card.new(card_params.merge(list: list))
    CardAction.create(description: "added this card to #{list.title}", card: @card)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
INSERT INTO "card_actions" ("description", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "added this card to The Novel "], ["card_id", 59], ["created_at", "2020-04-27 22:19:22.693854"], ["updated_at", "2020-04-27 22:19:22.693854"]]
INSERT INTO "cards" ("title", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Don Quixote"], ["list_id", 31], ["created_at", "2020-04-27 22:19:22.686073"], ["updated_at", "2020-04-27 22:19:22.686073"]]

  def show
    @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]