app/controllers/api/lists_controller.rb

    def create
        board = Board.find(params[:board_id])
        @list = List.new(list_params.merge(board: board))

        if @list.save
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "lists" ("title", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "The Novel  - Reading History through Novel"], ["board_id", 13], ["created_at", "2020-04-27 22:17:57.566950"], ["updated_at", "2020-04-27 22:17:57.566950"]]

    def update
        @list = List.find(params[:id])

        if @list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "The Novel  - Reading History Novel"], ["updated_at", "2020-04-27 22:18:12.013796"], ["id", 31]]