app/views/api/cards/show.json.jbuilder

end
json.comments_count @card.comments.count
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."card_id" = $1  [["card_id", 58]]